/*                搜索方法关联图

  
   	Branch&Bound		**		   控制最大深度,迭代加深
	(分支限界)	 /---(g=0)DFS--------------------DFSID-----\ 加入启发式
(加入最优先剪枝)/		  \                                 \用于限制深度 
   **DFSBnB	---- 		   \(状态转移                        ----- IDA*  迭代A*
	general 				\的优先)    下界估算函数,f递增  / 控制最大深度
Heuristic Search  ----------PFS-------- (f=g+h)---A* search/  控制空间
				\			/                      |  ***
				 \		** /(判重)                 |
				  \	----BFS(h=0)                   |
						|                          |
						|                          |
					  (双向)--------------------...
					   biBFS
						|
						|(一次反向)
					perimeter search

 */